---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.Spacing
source: html/56add314-9f76-d2bd-afa7-fa9fed067ef3.htm
---
# Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.Spacing Property

The spacing between the bars, according to the LayoutRule.

## Syntax (C#)
```csharp
public double Spacing { get; }
```